==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ResidualEEGModel                         [1, 4]                    --
├─Conv2d: 1-1                            [1, 500, 17, 8]           --
│    └─Conv2d: 2-1                       [1, 8, 500, 17]           440
├─BatchNorm2d: 1-2                       [1, 500, 17, 8]           --
│    └─BatchNorm2d: 2-2                  [1, 8, 17, 500]           16
├─Conv2d: 1-3                            [1, 500, 17, 8]           --
│    └─Conv2d: 2-3                       [1, 8, 500, 17]           3,520
├─BatchNorm2d: 1-4                       [1, 500, 17, 8]           --
│    └─BatchNorm2d: 2-4                  [1, 8, 17, 500]           16
├─Conv2d: 1-5                            [1, 500, 17, 16]          --
│    └─Conv2d: 2-5                       [1, 16, 500, 17]          7,040
├─BatchNorm2d: 1-6                       [1, 500, 17, 16]          --
│    └─BatchNorm2d: 2-6                  [1, 16, 17, 500]          32
├─ELU: 1-7                               [1, 500, 17, 16]          --
├─Pooling2d: 1-8                         [1, 100, 17, 16]          --
│    └─AvgPool2d: 2-7                    [1, 16, 100, 17]          --
├─Dropout: 1-9                           [1, 100, 17, 16]          --
├─Conv2d: 1-10                           [1, 100, 1, 16]           --
│    └─Conv2d: 2-8                       [1, 16, 100, 1]           4,352
├─Conv2d: 1-11                           [1, 100, 1, 16]           --
│    └─Conv2d: 2-9                       [1, 16, 100, 1]           256
├─BatchNorm2d: 1-12                      [1, 100, 1, 16]           --
│    └─BatchNorm2d: 2-10                 [1, 16, 1, 100]           32
├─Conv2d: 1-13                           [1, 100, 17, 16]          --
│    └─Conv2d: 2-11                      [1, 16, 100, 17]          14,080
├─Conv2d: 1-14                           [1, 100, 17, 16]          --
│    └─Conv2d: 2-12                      [1, 16, 100, 17]          256
├─BatchNorm2d: 1-15                      [1, 100, 17, 16]          --
│    └─BatchNorm2d: 2-13                 [1, 16, 17, 100]          32
├─ELU: 1-16                              [1, 100, 17, 16]          --
├─Pooling2d: 1-17                        [1, 12, 17, 16]           --
│    └─AvgPool2d: 2-14                   [1, 16, 12, 17]           --
├─Dropout: 1-18                          [1, 12, 17, 16]           --
├─Conv2d: 1-19                           [1, 12, 16, 4]            --
│    └─Conv2d: 2-15                      [1, 4, 12, 16]            1,920
├─Sequential: 1-20                       [1, 4]                    --
│    └─Flatten: 2-16                     [1, 768]                  --
│    └─Linear: 2-17                      [1, 4]                    --
│    │    └─Linear: 3-1                  [1, 4]                    3,076
│    └─LogSoftmax: 2-18                  [1, 4]                    --
==========================================================================================
Total params: 35,068
Trainable params: 35,068
Non-trainable params: 0
Total mult-adds (M): 118.70
==========================================================================================
Input size (MB): 0.03
Forward/backward pass size (MB): 5.05
Params size (MB): 0.14
Estimated Total Size (MB): 5.22
==========================================================================================