==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
EEGNet                                   [1, 4]                    --
├─Sequential: 1-1                        [1, 17, 1, 428]           --
│    └─Conv2d: 2-1                       [1, 500, 17, 61]          --
│    │    └─Conv2d: 3-1                  [1, 61, 500, 17]          3,111
│    └─BatchNorm2d: 2-2                  [1, 500, 17, 61]          --
│    │    └─BatchNorm2d: 3-2             [1, 61, 17, 500]          122
│    └─Conv2d: 2-3                       [1, 500, 1, 244]          --
│    │    └─Conv2d: 3-3                  [1, 244, 500, 1]          4,148
│    └─BatchNorm2d: 2-4                  [1, 500, 1, 244]          --
│    │    └─BatchNorm2d: 3-4             [1, 244, 1, 500]          488
│    └─ELU: 2-5                          [1, 500, 1, 244]          --
│    └─Pooling2d: 2-6                    [1, 125, 1, 244]          --
│    │    └─AvgPool2d: 3-5               [1, 244, 125, 1]          --
│    └─Dropout: 2-7                      [1, 125, 1, 244]          --
│    └─Conv2d: 2-8                       [1, 125, 1, 244]          --
│    │    └─Conv2d: 3-6                  [1, 244, 125, 1]          3,660
│    └─Conv2d: 2-9                       [1, 125, 1, 428]          --
│    │    └─Conv2d: 3-7                  [1, 428, 125, 1]          104,432
│    └─BatchNorm2d: 2-10                 [1, 125, 1, 428]          --
│    │    └─BatchNorm2d: 3-8             [1, 428, 1, 125]          856
│    └─ELU: 2-11                         [1, 125, 1, 428]          --
│    └─Pooling2d: 2-12                   [1, 17, 1, 428]           --
│    │    └─AvgPool2d: 3-9               [1, 428, 17, 1]           --
│    └─Dropout: 2-13                     [1, 17, 1, 428]           --
├─Sequential: 1-2                        [1, 4]                    --
│    └─Flatten: 2-14                     [1, 7276]                 --
│    └─Linear: 2-15                      [1, 4]                    --
│    │    └─Linear: 3-10                 [1, 4]                    29,108
│    └─LogSoftmax: 2-16                  [1, 4]                    --
==========================================================================================
Total params: 145,925
Trainable params: 145,925
Non-trainable params: 0
Total mult-adds (M): 42.06
==========================================================================================
Input size (MB): 0.03
Forward/backward pass size (MB): 11.35
Params size (MB): 0.58
Estimated Total Size (MB): 11.97
==========================================================================================