==========================================================================================
Layer (type:depth-idx)                   Output Shape              Param #
==========================================================================================
ResidualEEGModel                         [1, 4]                    --
├─Conv2d: 1-1                            [1, 500, 17, 8]           --
│    └─Conv2d: 2-1                       [1, 8, 500, 17]           504
├─BatchNorm2d: 1-2                       [1, 500, 17, 8]           --
│    └─BatchNorm2d: 2-2                  [1, 8, 17, 500]           16
├─Conv2d: 1-3                            [1, 500, 17, 8]           --
│    └─Conv2d: 2-3                       [1, 8, 500, 17]           3,264
├─BatchNorm2d: 1-4                       [1, 500, 17, 8]           --
│    └─BatchNorm2d: 2-4                  [1, 8, 17, 500]           16
├─Conv2d: 1-5                            [1, 500, 17, 16]          --
│    └─Conv2d: 2-5                       [1, 16, 500, 17]          8,064
├─BatchNorm2d: 1-6                       [1, 500, 17, 16]          --
│    └─BatchNorm2d: 2-6                  [1, 16, 17, 500]          32
├─ELU: 1-7                               [1, 500, 17, 16]          --
├─Pooling2d: 1-8                         [1, 125, 17, 16]          --
│    └─AvgPool2d: 2-7                    [1, 16, 125, 17]          --
├─Dropout: 1-9                           [1, 125, 17, 16]          --
├─Conv2d: 1-10                           [1, 125, 1, 16]           --
│    └─Conv2d: 2-8                       [1, 16, 125, 1]           4,352
├─Conv2d: 1-11                           [1, 125, 1, 16]           --
│    └─Conv2d: 2-9                       [1, 16, 125, 1]           256
├─BatchNorm2d: 1-12                      [1, 125, 1, 16]           --
│    └─BatchNorm2d: 2-10                 [1, 16, 1, 125]           32
├─Conv2d: 1-13                           [1, 125, 17, 16]          --
│    └─Conv2d: 2-11                      [1, 16, 125, 17]          3,840
├─Conv2d: 1-14                           [1, 125, 17, 16]          --
│    └─Conv2d: 2-12                      [1, 16, 125, 17]          256
├─BatchNorm2d: 1-15                      [1, 125, 17, 16]          --
│    └─BatchNorm2d: 2-13                 [1, 16, 17, 125]          32
├─ELU: 1-16                              [1, 125, 17, 16]          --
├─Pooling2d: 1-17                        [1, 15, 17, 16]           --
│    └─AvgPool2d: 2-14                   [1, 16, 15, 17]           --
├─Dropout: 1-18                          [1, 15, 17, 16]           --
├─Conv2d: 1-19                           [1, 15, 17, 4]            --
│    └─Conv2d: 2-15                      [1, 4, 15, 17]            1,472
├─Sequential: 1-20                       [1, 4]                    --
│    └─Flatten: 2-16                     [1, 1020]                 --
│    └─Linear: 2-17                      [1, 4]                    --
│    │    └─Linear: 3-1                  [1, 4]                    4,084
│    └─LogSoftmax: 2-18                  [1, 4]                    --
==========================================================================================
Total params: 26,220
Trainable params: 26,220
Non-trainable params: 0
Total mult-adds (M): 110.23
==========================================================================================
Input size (MB): 0.03
Forward/backward pass size (MB): 5.22
Params size (MB): 0.10
Estimated Total Size (MB): 5.36
==========================================================================================